Revit.Elements.Viewport.InternalViewport
An internal reference to the Viewport

Revit.Elements.Viewport.InternalElement
Reference to the Element

Revit.Elements.Viewport.#ctor(Autodesk.Revit.DB.Viewport)
Private constructor for the Element
viewport:

Revit.Elements.Viewport.InitViewport(Autodesk.Revit.DB.Viewport)
Initialize a Viewport element
viewport:

Revit.Elements.Viewport.InternalSetViewport(Autodesk.Revit.DB.Viewport)
Set the Viewport property, element id, and unique id
viewport:

Revit.Elements.Viewport.BySheetViewLocation(Revit.Elements.Views.Sheet,Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point)
Creates a new Viewport at a given location on a sheet.
sheet: The Sheet on which the new Viewport will be placed.
view: The view shown in the Viewport.
location: The new Viewport will be centered on this point.
Returns: The new Viewport.

Revit.Elements.Viewport.FromExisting(Autodesk.Revit.DB.Viewport,System.Boolean)
Create a Viewport from a user selected Element.
viewport:
isRevitOwned:
Returns: